Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType)
Create a segment length constraint.
paramId:
The Id of a Rebar Shape parameter.
refType0:
Choose between two possibilities for the first reference of the length constraint.
refType1:
Choose between two possibilities for the second reference of the length constraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012